// Contains source code to various header files.

#ifndef NX_FOUNDATION_NX
#define NX_FOUNDATION_NX
/*----------------------------------------------------------------------------*\
|
|						Public Interface to Ageia PhysX Technology
|
|							     www.ageia.com
|
\*----------------------------------------------------------------------------*/

/** \addtogroup foundation
  @{
*/

/**
DLL export macros
*/
#ifndef NX_C_EXPORT
	#define NX_C_EXPORT extern "C"
#endif

#ifndef NX_CALL_CONV
	#if defined WIN32
		#define NX_CALL_CONV __cdecl
	#elif defined LINUX
		#define NX_CALL_CONV
    #elif defined __APPLE__
        #define NX_CALL_CONV
	#elif defined __CELLOS_LV2__
		#define NX_CALL_CONV
	#elif defined _XBOX
        #define NX_CALL_CONV
	#elif defined(__PPCGEKKO__)
        #define NX_CALL_CONV
	#else
		#error custom definition of NX_CALL_CONV for your OS needed!
	#endif
#endif

#if	  defined NX32
#elif defined NX64
#elif defined _WIN64
	#ifdef NX32
		#error PhysX SDK: Platforms pointer size ambiguous!  The defines WIN64 and NX32 are in conflict.
	#endif
	#define NX64
#elif defined WIN32
	#ifdef NX64
		#error PhysX SDK: Platforms pointer size ambiguous!  The defines WIN32 and NX64 are in conflict.
	#endif
	#define NX32
#elif defined __CELLOS_LV2__
	#ifdef __LP32__
            #define NX32
    #else
            #define NX64
    #endif
#elif defined _XBOX
	#define NX32
#elif defined LINUX
        #define NX32

	\brief Normal/default priority
	*/
	NX_TP_NORMAL	    =2,

    /**
	\brief Below Normal priority
	*/
    NX_TP_BELOW_NORMAL  =3,

	/**
	\brief Low priority.
	*/
	NX_TP_LOW		    =4,

	NX_TP_FORCE_DWORD = 0xffFFffFF
};

 /** @} */
#endif
//AGCOPYRIGHTBEGIN
///////////////////////////////////////////////////////////////////////////
// Copyright (c) 2005 AGEIA Technologies.
// All rights reserved. www.ageia.com
///////////////////////////////////////////////////////////////////////////
//AGCOPYRIGHTEND

#ifndef NX_FOUNDATION_NXSIMPLETYPES
#define NX_FOUNDATION_NXSIMPLETYPES
/*----------------------------------------------------------------------------*\
|
|						Public Interface to Ageia PhysX Technology
|
|							     www.ageia.com
|
\*----------------------------------------------------------------------------*/
/** \addtogroup foundation
  @{
*/

// Platform specific types:
//Design note: Its OK to use int for general loop variables and temps.

#ifdef WIN32
	typedef __int64				NxI64;
	typedef signed int			NxI32;
	typedef signed short		NxI16;
	typedef signed char			NxI8;

	typedef unsigned __int64	NxU64;
	typedef unsigned int		NxU32;
	typedef unsigned short		NxU16;
	typedef unsigned char		NxU8;

	typedef float				NxF32;
	typedef double				NxF64;

#elif LINUX
	typedef long long			NxI64;
	typedef signed int			NxI32;
	typedef signed short		NxI16;
	typedef signed char			NxI8;

	typedef unsigned long long	NxU64;
	typedef unsigned int		NxU32;
	typedef unsigned short		NxU16;
	typedef unsigned char		NxU8;

	typedef float				NxF32;
	typedef double				NxF64;

#elif __APPLE__
	typedef long long			NxI64;
	typedef signed int			NxI32;
	typedef signed short		NxI16;
	typedef signed char			NxI8;

	typedef unsigned long long	NxU64;
	typedef unsigned int		NxU32;
	typedef unsigned short		NxU16;
	typedef unsigned char		NxU8;

	typedef float				NxF32;
	typedef double				NxF64;

#elif __CELLOS_LV2__
	typedef long long			NxI64;
	typedef signed int			NxI32;
	typedef signed short		NxI16;
	typedef signed char			NxI8;

	typedef unsigned long long	NxU64;
	typedef unsigned int		NxU32;
	typedef unsigned short		NxU16;
	typedef unsigned char		NxU8;

	typedef float				NxF32;
	typedef double				NxF64;

#elif _XBOX
	typedef __int64				NxI64;
	typedef signed int			NxI32;
	typedef signed short		NxI16;
	typedef signed char			NxI8;

	typedef unsigned __int64	NxU64;
	typedef unsigned int		NxU32;
	typedef unsigned short		NxU16;
	typedef unsigned char		NxU8;

	typedef float				NxF32;
	typedef double				NxF64;
    
#elif defined(__PPCGEKKO__)
	typedef long long			NxI64;
	typedef signed int			NxI32;
	typedef signed short		NxI16;
	typedef signed char			NxI8;

	typedef unsigned long long	NxU64;
	typedef unsigned int		NxU32;
	typedef unsigned short		NxU16;
	typedef unsigned char		NxU8;

	typedef float				NxF32;
	typedef double				NxF64;

#else
	#error Unknown platform!
#endif

union NxU32F32
{
	NxU32 u;
	NxF32 f;
};

#if __APPLE__
    NX_COMPILE_TIME_ASSERT(sizeof(bool)==4);    // PPC has 4 byte bools
#else
	NX_COMPILE_TIME_ASSERT(sizeof(bool)==1);	// ...otherwise things might fail with VC++ 4.2 !
#endif
	NX_COMPILE_TIME_ASSERT(sizeof(NxI8)==1);
	NX_COMPILE_TIME_ASSERT(sizeof(NxU8)==1);
	NX_COMPILE_TIME_ASSERT(sizeof(NxI16)==2);
	NX_COMPILE_TIME_ASSERT(sizeof(NxU16)==2);
	NX_COMPILE_TIME_ASSERT(sizeof(NxI32)==4);
	NX_COMPILE_TIME_ASSERT(sizeof(NxU32)==4);
	NX_COMPILE_TIME_ASSERT(sizeof(NxI64)==8);
	NX_COMPILE_TIME_ASSERT(sizeof(NxU64)==8);
#if defined(NX64)
	NX_COMPILE_TIME_ASSERT(sizeof(void*)==8);
#else
	NX_COMPILE_TIME_ASSERT(sizeof(void*)==4);
#endif

	// Type ranges
	#define	NX_MAX_I8			0x7f			//max possible sbyte value
	#define	NX_MIN_I8			0x80			//min possible sbyte value
	#define	NX_MAX_U8			0xff			//max possible ubyte value
	#define	NX_MIN_U8			0x00			//min possible ubyte value
	#define	NX_MAX_I16			0x7fff			//max possible sword value
	#define	NX_MIN_I16			0x8000			//min possible sword value
	#define	NX_MAX_U16			0xffff			//max possible uword value
	#define	NX_MIN_U16			0x0000			//min possible uword value
	#define	NX_MAX_I32			0x7fffffff		//max possible sdword value
	#define	NX_MIN_I32			0x80000000		//min possible sdword value
	#define	NX_MAX_U32			0xffffffff		//max possible udword value
	#define	NX_MIN_U32			0x00000000		//min possible udword value
	#define	NX_MAX_F32			FLT_MAX			//max possible float value
	#define	NX_MIN_F32			(-FLT_MAX)		//min possible float value
	#define	NX_MAX_F64			DBL_MAX			//max possible double value
